Masmiseim36/nxpSDK/devices/MIMXRT798S/periph/PERI_SYSCON2.h
/*
** ###################################################################
**     Processors:          MIMXRT735SGAWBR_cm33_core0
**                          MIMXRT735SGAWBR_cm33_core1
**                          MIMXRT735SGAWBR_ezhv
**                          MIMXRT735SGAWBR_hifi1
**                          MIMXRT735SGFOB_cm33_core0
**                          MIMXRT735SGFOB_cm33_core1
**                          MIMXRT735SGFOB_ezhv
**                          MIMXRT735SGFOB_hifi1
**                          MIMXRT758SGAWBR_cm33_core0
**                          MIMXRT758SGAWBR_cm33_core1
**                          MIMXRT758SGAWBR_ezhv
**                          MIMXRT758SGAWBR_hifi1
**                          MIMXRT758SGFOB_cm33_core0
**                          MIMXRT758SGFOB_cm33_core1
**                          MIMXRT758SGFOB_ezhv
**                          MIMXRT758SGFOB_hifi1
**                          MIMXRT798SGAWBR_cm33_core0
**                          MIMXRT798SGAWBR_cm33_core1
**                          MIMXRT798SGAWBR_ezhv
**                          MIMXRT798SGAWBR_hifi1
**                          MIMXRT798SGAWBR_hifi4
**                          MIMXRT798SGFOB_cm33_core0
**                          MIMXRT798SGFOB_cm33_core1
**                          MIMXRT798SGFOB_ezhv
**                          MIMXRT798SGFOB_hifi1
**                          MIMXRT798SGFOB_hifi4
**
**     Version:             rev. 4.0, 2025-06-06
**     Build:               b250606
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SYSCON2
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-09-15)
**         Initial version.
**     - rev. 2.0 (2024-05-28)
**         Rev2 DraftA.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**     - rev. 4.0 (2025-06-06)
**         B0 initial version
**
** ###################################################################
*/

/*!
 * @file PERI_SYSCON2.h
 * @version 4.0
 * @date 2025-06-06
 * @brief CMSIS Peripheral Access Layer for SYSCON2
 *
 * CMSIS Peripheral Access Layer for SYSCON2
 */

#if !defined(PERI_SYSCON2_H_)
#define PERI_SYSCON2_H_                          /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT735SGAWBR_cm33_core0) || defined(CPU_MIMXRT735SGFOB_cm33_core0))
#include "MIMXRT735S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_cm33_core1) || defined(CPU_MIMXRT735SGFOB_cm33_core1))
#include "MIMXRT735S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_ezhv) || defined(CPU_MIMXRT735SGFOB_ezhv))
#include "MIMXRT735S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWBR_hifi1) || defined(CPU_MIMXRT735SGFOB_hifi1))
#include "MIMXRT735S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_cm33_core0) || defined(CPU_MIMXRT758SGFOB_cm33_core0))
#include "MIMXRT758S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_cm33_core1) || defined(CPU_MIMXRT758SGFOB_cm33_core1))
#include "MIMXRT758S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_ezhv) || defined(CPU_MIMXRT758SGFOB_ezhv))
#include "MIMXRT758S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWBR_hifi1) || defined(CPU_MIMXRT758SGFOB_hifi1))
#include "MIMXRT758S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_cm33_core0) || defined(CPU_MIMXRT798SGFOB_cm33_core0))
#include "MIMXRT798S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_cm33_core1) || defined(CPU_MIMXRT798SGFOB_cm33_core1))
#include "MIMXRT798S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_ezhv) || defined(CPU_MIMXRT798SGFOB_ezhv))
#include "MIMXRT798S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_hifi1) || defined(CPU_MIMXRT798SGFOB_hifi1))
#include "MIMXRT798S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWBR_hifi4) || defined(CPU_MIMXRT798SGFOB_hifi4))
#include "MIMXRT798S_hifi4_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#elif defined(__XTENSA__)
  /* anonymous unions are enabled by default */
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SYSCON2 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON2_Peripheral_Access_Layer SYSCON2 Peripheral Access Layer
 * @{
 */

/** SYSCON2 - Size of Registers Arrays */
#define SYSCON2_GPR_COUNT                         2u

/** SYSCON2 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4064];
  __IO uint32_t GPR[SYSCON2_GPR_COUNT];            /**< General Purpose Register 0..General Purpose Register 1, array offset: 0xFE0, array step: 0x4 */
} SYSCON2_Type;

/* ----------------------------------------------------------------------------
   -- SYSCON2 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON2_Register_Masks SYSCON2 Register Masks
 * @{
 */

/*! @name GPR - General Purpose Register 0..General Purpose Register 1 */
/*! @{ */

#define SYSCON2_GPR_GPR_MASK                     (0xFFFFFFFFU)
#define SYSCON2_GPR_GPR_SHIFT                    (0U)
/*! GPR - General Purpose Register Bits */
#define SYSCON2_GPR_GPR(x)                       (((uint32_t)(((uint32_t)(x)) << SYSCON2_GPR_GPR_SHIFT)) & SYSCON2_GPR_GPR_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SYSCON2_Register_Masks */


/*!
 * @}
 */ /* end of group SYSCON2_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#elif defined(__XTENSA__)
  /* leave anonymous unions enabled */
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SYSCON2_H_ */

